        >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. Project 3.
AUTHOR. John Stephen Johnson.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
SCREEN SECTION.

PROCEDURE DIVISION.
100-MAIN.

