        >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. Project 3.
AUTHOR. John Stephen Johnson.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 SNUMS.
      03 SHRS PIC 999V99.
      03 SRTE PIC 999V99.
      03 SRHRS PIC 999V99.
      03 SOHRS PIC 999V99.
      03 SRPAY PIC 999V99.
      03 SROPAY PIC 999V99.
      


SCREEN SECTION.

PROCEDURE DIVISION.
100-MAIN.

